import 'package:flutter/material.dart';
import 'package:flutter_bloc/flutter_bloc.dart';

import '../component/drawer.dart';
import '../home/theme_cubit.dart';

class support extends StatelessWidget {
  const support({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.transparent,
        elevation: 0,
        leading: Text(""),
        title: Center(
            child: Text(
          "psychological support",
          style: TextStyle(
            color: Color(0xFF439be8),
            fontSize: 25,
            fontWeight: FontWeight.bold,
          ),
        )),
      ),
      drawer: Drower(),
      body: ListView.builder(
        itemCount: data.length,
        itemBuilder: (BuildContext context, int index) => EntryItem(
          data[index],
        ),
      ),
    );
  }
}

class Entry {
  final String title;
  final List<Entry> children;

  Entry(this.title, [this.children = const <Entry>[]]);
}

final List<Entry> data = <Entry>[
  Entry(
    'إسلام طارق',
    <Entry>[
      Entry(
          "«إسلام طارق»، يبلغ من العمر 22 عاما، قضى منها نحو 20 فى الجزائر وعاد لمصر منذ عام ونصف "
          "العام، واكتشف أنه مصاب بالسرطان وروى مأساتهفقال: كانت البداية بألم فى المعدة قبل شهر رمضان الماضى بأسبوع، وعندما ذهبت للطبيب أخبرنى بأننى أعانى من نزله معوية وتناولت أدوية لمدة أسبوع، تدهورت فيه حالتى وأصبت بـ«كحة» مستمرة طوال اليوم يصاحبها نزول دم من الفم، وعندما توجهت إلى طبيب آخر طلب منى إجراء أشعة على الصدر وقال لى وقتها بأنى أعانى من التهاب رئوى ووصف لى أدوية أخرى استمر تعاطيها 10 أيام دون جدوى."
          "وأضاف إسلام، الذى درس بكلية الألسن، ويعشق السفر والقراءة والرياضة خاصة الجرى: انتابتنى حالة من الخوف بعدما شعرت بأن مرضى خطير ويهدد حياتى ولذا توجهت إلى طبيب أورام واكتشفت إصابتى بـ«سرطان الرئة»."
          "ى فالواقع هو أننى شعرت باليأس والاستسلام وأن الموت يقترب منى وأنتظره بين الحين والآخر.. كانت حالتى النفسية صفر، وأثناء وجودى فى الحياة المغلقة التى خلقتها لنفسى داخل المستشفى لتعاطى العلاج الكيماوى تعرفت على شباب مصابين مثلى بالسرطان ولكنهم منضمون لجمعية Can Survive، هؤلاء ساعدونى نفسيا كثيرا وقدموا لى الدعم الكبير الذى رفع معنوياتى للتغلب على السرطان، وأنا حاليا أستكمل حياتى وعلاجى معا وأتماثل للشفاء، وأقدم للآخرين الدعم المعنوى والنفسى لنكون معا محاربين لهذا اللهو الخفى التى يدمر حياتنا.")
    ],
  ),
  // Second Row
  Entry('رشا', <Entry>[
    Entry(
        'أسئلة طاردت «رشا محمد» عند خضوعها لجلسات العلاج الكيماوى الأولى المؤلمة،.. قالت لـ«اليوم السابع»: ظهر فى جسمى ورم خلال شهر فبراير 2015 واستأصله الأطباء وبعد 25 يوما من العملية عرفت أنه خبيث ويجب أن أخضع لجلسات علاج كيماوى.'
        ' الغرفة مرة أخرى على قدمى.. قرأت القرآن وتقربت من الله فقويت إرادتى ومرت مرحلة العلاج الكيميائى على خير وانتقلت إلى جلسة الإشعاع والتى لم تكن مؤلمة مثل الكيماوى لكن آثارها الجانبية كثيرة. '
        "يحدث فبمجرد علمه بأن الورم الذى أصابنى خبيث تغيرت معاملته معى وظهرت صورته الحقيقية التى أخفاها منذ زواجنا، وبعد مواجهة حادة بيننا عرفت أنه لا يريدنى مريضة وبالفعل طلقنى، وكان هذا هو الدافع القوى لمقاومة المرض ليرى أننى سأعيش بدونه وأستكمل حياتى من جديد كما كنت من قبل، والآن أخضع للعلاج الهرمونى والنتائج تشير لتحسن كبير فى حالتى."),
  ]),

  Entry(
    ' محمد عادل',
    <Entry>[
      Entry(
          'كنت أمارس الرياضة يوميا ولم أدخن سيجارة واحدة، وصحتى استمرت جيدة إلى أن فاجأنى التعب ودخلت المستشفى وفيه عشت بين الحياة والموت، حيث ارتفعت حرارتى إلى 41 درجة بلا انخفاض، واستمر هذا الحال حوالى شهر ونصف الشهر، انخفض فيها وزنى جدا، ولم يعرف الأطباء فى البداية حقيقة مرضى، واستسلمت لمرض لا أعرفه.'
          "وأضاف محمد: ضحكت من كمية التشخيص الخاطئ والغريب عن حالتى، ومنها «تمزق فى عضلات البطن لعدم التسخين الجيد قبل التمارين الرياضية - مشكلة فى الجهاز التنفسى بسبب التدخين رغم أنى لم أدخن فى حياتى - سل» وخلال هذه الفترة دخلت جسدى 82 حقنة فى 3 أسابيع، وأخيرا انخفضت درجة حرارتى ومن فرحتى ساعتها نمت يومين، وعندما استيقظت بدأت معاناتى من جديد لكن هذه المرة مع الكحة والدوخة."
          "      وتابع: ذهبت لطبيب آخر وبعد الكشف طلب منى التوجه فورا إلى معمل التحاليل لعمل تحاليل معينة بجانب الأشعة والعودة إليه ووقتها شعرت لأول مرة بخوف شديد أوقف نبض قلبى وبعد قليل عدت للطبيب بالتحاليل وبعد مشاهدته للأشعة قال لى «أنت مصاب بسرطان الرئة» واكتشفت أن الورم فى الغدد الليمفاوية، وبداية العلاج كانت مع الكيماوى والطبيب المعالج كان صريحا معى فى كل شىء وحدثنى عن النتائج المتوقعة حتى لا أقلق."
          "      وبعد تنهيدة تذكر «محمد» أول جلسة علاج كيماوى وعنها قال: «الناس كانت بتسلم عليا وتبص لى بعيون حزينة وأنا شعرت كأنى فى كابوس أريد أن أفيق منه سريعا ومع وصول المصل إلى عروقى شعرت بالنار فيها وأيقنت بأنى لا أزال على قيد الحياة أتألم كثيرا من شدة المصل، ثم نظرت حولى ووجدت شبابا يحصلون على جرعاتهم ويتألمون مثلى ففكرت فى الحديث معهم لننسى معا الألم»."
          "      «جدى أحلى حاجة فى حياتى» هكذا عبر «محمد» عما قدم له من الدعم النفسى أثناء رحلة علاجه، وقال: «زارنى جدى بعد أول جلسة علاج كيماوى وقال لى: «أنت على طول شاطر وسابق سنك وبينضرب بيك المثل، ودا مرض الخمسين وأنت دلوقتى تأخذ خبرة الخمسين قول الحمد لله عندك عربية بتروح وترجع بيها غيرك معندوش وغيرها من نعم ربنا عليك افتكرها وخليها أمامك وكل ما تحس بتعب قول الحمد لله»."
          "واختتم محمد حديثة: «استكملت علاجى وكنت فى كل جلسة أساعد مجموعة مرضى فى تخفيف آلامهم، استمتعت بحياتى دون أن يترك السرطان أثر كبير وقهرت المرض والآن أساعد غيرى حتى يقهره مثلى»."),
    ],
  ),
];

// Create the Widget for the row
class EntryItem extends StatelessWidget {
  const EntryItem(this.entry);

  final Entry entry;

  // This function recursively creates the multi-level list rows.
  Widget _buildTiles(Entry root) {
    if (root.children.isEmpty) {
      return ListTile(
        title: Text(root.title),
      );
    }
    return ExpansionTile(
      key: PageStorageKey<Entry>(root),
      title: Text(root.title),
      children: root.children.map<Widget>(_buildTiles).toList(),
    );
  }

  @override
  Widget build(BuildContext context) {
    return _buildTiles(entry);
  }
}
